perf/rates.yaml
config:
  http:
    timeout: 60
    pool: 50
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  phases:
    - name: Plain # Para eliminar el ruido de inicio
      duration: 60
      arrivalRate: 20
    - name: Ramp # Rampa de carga hasta los valores máximos utilizados
      duration: 180
      arrivalRate: 20
      rampTo: 180
    

scenarios:
  - name: Rates (/rates)
    flow:
      - get:
          url: '/rates'